Notebook.org
#+TITLE: QuarkSuite (v2)
#+PROPERTY: header-args:deno :tangle yes :mkdirp yes
#+PROPERTY: header-args:js :tangle yes :mkdirp yes
#+PROPERTY: header-args:shell :results output code

* Table of Contents :TOC@5:
- [[#summary][Summary]]
- [[#whats-new-in-v2][What's New in v2?]]
  - [[#workflows][Workflows]]
  - [[#concrete-idioms][Concrete Idioms]]
  - [[#settled-types][Settled Types]]
  - [[#simple-data-rendering][Simple Data Rendering]]
  - [[#wtcg-design-token-spec][WTCG Design Token Spec]]
  - [[#improved-performance][Improved Performance]]
  - [[#internal-simplicity][Internal Simplicity]]
  - [[#improved-modularity][Improved Modularity]]
- [[#spec][Spec]]
  - [[#api][API]]
    - [[#functional-utilities][Functional Utilities]]
      - [[#fn_process][fn_process]]
        - [[#fn_process-examples][fn_process Examples]]
        - [[#fn_process-implementation][fn_process Implementation]]
        - [[#fn_process-tests][fn_process Tests]]
        - [[#fn_process-errors][fn_process Errors]]
      - [[#fn_preset][fn_preset]]
        - [[#fn_preset-examples][fn_preset Examples]]
        - [[#fn_preset-implementation][fn_preset Implementation]]
        - [[#fn_preset-tests][fn_preset Tests]]
        - [[#fn_preset-errors][fn_preset Errors]]
      - [[#fn_pipeline][fn_pipeline]]
        - [[#fn_pipeline-examples][fn_pipeline Examples]]
        - [[#fn_pipeline-implementation][fn_pipeline Implementation]]
        - [[#fn_pipeline-tests][fn_pipeline Tests]]
        - [[#fn_pipeline-errors][fn_pipeline Errors]]
    - [[#color][Color]]
      - [[#color_adjust][color_adjust]]
        - [[#color_adjust-examples][color_adjust Examples]]
        - [[#color_adjust-implementation][color_adjust Implementation]]
        - [[#color_adjust-tests][color_adjust Tests]]
      - [[#color_mix][color_mix]]
        - [[#color_mix-examples][color_mix Examples]]
        - [[#color_mix-implementation][color_mix Implementation]]
        - [[#color_mix-tests][color_mix Tests]]
      - [[#color_as_hex][color_as_hex]]
        - [[#color_as_hex-examples][color_as_hex Examples]]
        - [[#color_as_hex-implementation][color_as_hex Implementation]]
        - [[#color_as_hex-tests][color_as_hex Tests]]
      - [[#color_as_rgb][color_as_rgb]]
        - [[#color_as_rgb-examples][color_as_rgb Examples]]
        - [[#color_as_rgb-implementation][color_as_rgb Implementation]]
        - [[#color_as_rgb-tests][color_as_rgb Tests]]
      - [[#color_as_hsl][color_as_hsl]]
        - [[#color_as_hsl-examples][color_as_hsl Examples]]
        - [[#color_as_hsl-implementation][color_as_hsl Implementation]]
        - [[#color_as_hsl-tests][color_as_hsl Tests]]
      - [[#color_as_cmyk][color_as_cmyk]]
        - [[#color_as_cmyk-examples][color_as_cmyk Examples]]
        - [[#color_as_cmyk-implementation][color_as_cmyk Implementation]]
        - [[#color_as_cmyk-tests][color_as_cmyk Tests]]
      - [[#color_as_hwb][color_as_hwb]]
        - [[#color_as_hwb-examples][color_as_hwb Examples]]
        - [[#color_as_hwb-implementation][color_as_hwb Implementation]]
        - [[#color_as_hwb-tests][color_as_hwb Tests]]
      - [[#color_as_cielab][color_as_cielab]]
        - [[#color_as_cielab-examples][color_as_cielab Examples]]
        - [[#color_as_cielab-implementation][color_as_cielab Implementation]]
        - [[#color_as_cielab-tests][color_as_cielab Tests]]
      - [[#color_as_cielch][color_as_cielch]]
        - [[#color_as_cielch-examples][color_as_cielch Examples]]
        - [[#color_as_cielch-implementation][color_as_cielch Implementation]]
        - [[#color_as_cielch-tests][color_as_cielch Tests]]
      - [[#color_as_oklab][color_as_oklab]]
        - [[#color_as_oklab-examples][color_as_oklab Examples]]
        - [[#color_as_oklab-implementation][color_as_oklab Implementation]]
        - [[#color_as_oklab-tests][color_as_oklab Tests]]
      - [[#color_as_oklch][color_as_oklch]]
        - [[#color_as_oklch-examples][color_as_oklch Examples]]
        - [[#color_as_oklch-implementation][color_as_oklch Implementation]]
        - [[#color_as_oklch-tests][color_as_oklch Tests]]
      - [[#color_as_dyad][color_as_dyad]]
        - [[#color_as_dyad-examples][color_as_dyad Examples]]
        - [[#color_as_dyad-implementation][color_as_dyad Implementation]]
        - [[#color_as_dyad-tests][color_as_dyad Tests]]
      - [[#color_as_complementary][color_as_complementary]]
        - [[#color_as_complementary-examples][color_as_complementary Examples]]
        - [[#color_as_complementary-implementation][color_as_complementary Implementation]]
        - [[#color_as_complementary-tests][color_as_complementary Tests]]
      - [[#color_as_analogous][color_as_analogous]]
        - [[#color_as_analogous-examples][color_as_analogous Examples]]
        - [[#color_as_analogous-implementation][color_as_analogous Implementation]]
        - [[#color_as_analogous-tests][color_as_analogous Tests]]
      - [[#color_as_split][color_as_split]]
        - [[#color_as_split-examples][color_as_split Examples]]
        - [[#color_as_split-implementation][color_as_split Implementation]]
        - [[#color_as_split-tests][color_as_split Tests]]
      - [[#color_as_clash][color_as_clash]]
        - [[#color_as_clash-examples][color_as_clash Examples]]
        - [[#color_as_clash-implementation][color_as_clash Implementation]]
        - [[#color_as_clash-tests][color_as_clash Tests]]
      - [[#color_as_triad][color_as_triad]]
        - [[#color_as_triad-examples][color_as_triad Examples]]
        - [[#color_as_triad-implementation][color_as_triad Implementation]]
        - [[#color_as_triad-tests][color_as_triad Tests]]
      - [[#color_as_tetrad][color_as_tetrad]]
        - [[#color_as_tetrad-examples][color_as_tetrad Examples]]
        - [[#color_as_tetrad-implementation][color_as_tetrad Implementation]]
        - [[#color_as_tetrad-tests][color_as_tetrad Tests]]
      - [[#color_as_square][color_as_square]]
        - [[#color_as_square-examples][color_as_square Examples]]
        - [[#color_as_square-implementation][color_as_square Implementation]]
        - [[#color_as_square-tests][color_as_square Tests]]
      - [[#color_as_star][color_as_star]]
        - [[#color_as_star-examples][color_as_star Examples]]
        - [[#color_as_star-implementation][color_as_star Implementation]]
        - [[#color_as_star-tests][color_as_star Tests]]
      - [[#color_as_hexagon][color_as_hexagon]]
        - [[#color_as_hexagon-examples][color_as_hexagon Examples]]
        - [[#color_as_hexagon-implementation][color_as_hexagon Implementation]]
        - [[#color_as_hexagon-tests][color_as_hexagon Tests]]
      - [[#color_as_tints][color_as_tints]]
      - [[#color_as_tones][color_as_tones]]
      - [[#color_as_shades][color_as_shades]]
      - [[#color_as_material][color_as_material]]
      - [[#color_as_blend][color_as_blend]]
      - [[#color_as_interpolation][color_as_interpolation]]
      - [[#color_as_token][color_as_token]]
      - [[#color_as_element][color_as_element]]
      - [[#palette_shift][palette_shift]]
      - [[#palette_sort][palette_sort]]
      - [[#palette_filter][palette_filter]]
      - [[#palette_contrast][palette_contrast]]
      - [[#palette_daltonize][palette_daltonize]]
    - [[#modular-scale][Modular Scale]]
      - [[#ms_create][ms_create]]
      - [[#ms_modify][ms_modify]]
      - [[#ms_split][ms_split]]
      - [[#ms_format][ms_format]]
      - [[#ms_as_tokens][ms_as_tokens]]
      - [[#ms_as_element][ms_as_element]]
    - [[#design-tokens][Design Tokens]]
      - [[#tokens_as_css][tokens_as_css]]
      - [[#tokens_as_scss][tokens_as_scss]]
      - [[#tokens_as_less][tokens_as_less]]
      - [[#tokens_as_styl][tokens_as_styl]]
      - [[#tokens_as_json][tokens_as_json]]
      - [[#tokens_as_yaml][tokens_as_yaml]]
      - [[#tokens_as_gpl][tokens_as_gpl]]
      - [[#tokens_as_sketchpalette][tokens_as_sketchpalette]]
      - [[#tokens_as_tailwind][tokens_as_tailwind]]
      - [[#tokens_as_styledict][tokens_as_styledict]]
      - [[#tokens_as_element][tokens_as_element]]
  - [[#internals][Internals]]
    - [[#functional][Functional]]
      - [[#composition-internals][Composition Internals]]
    - [[#color-1][Color]]
      - [[#conversion][Conversion]]
        - [[#tokenization][Tokenization]]
        - [[#validation][Validation]]
        - [[#extraction][Extraction]]
        - [[#parsing][Parsing]]
        - [[#calculation][Calculation]]
        - [[#serialization][Serialization]]
      - [[#color-adjustment][Color Adjustment]]
        - [[#target-properties][Target Properties]]
        - [[#perceptually-uniform-color-adjustment][Perceptually Uniform Color Adjustment]]
        - [[#color-adjustment-through-oklch][Color Adjustment Through OKLCH]]
      - [[#color-mixture][Color Mixture]]
        - [[#perceptually-uniform-color-mixture][Perceptually Uniform Color Mixture]]
        - [[#color-mixture-through-oklab][Color Mixture Through OKLab]]
    - [[#modular-scale-internals][Modular Scale Internals]]
    - [[#design-token-internals][Design Token Internals]]

* Summary

This document is my scratchpad/workspace as I further refine QuarkSuite. Literate programming gives me a clear space to
think, iterate, and speculate on different approaches to my ultimate goal of a more enjoyable, flexible, and powerful
design token development environment for web projects.

* What's New in v2?

** Workflows

v1 focused on utilities as the base API and built abstractions (formulas, bootstrappers) on top of it. v2 focuses
*exclusively* on the relationship between types, their available actions, and output emitters.

Rather than providing the factory pattern, I've resolved to /further improve/ the functional workflow.

** Concrete Idioms

Where v1 differentiated between its abstractions with a host of naming conventions, v2 reinforces an idiomatic
relationship between functions and their purpose. The API now follows a simple, explicit naming convention.

+ =type_action(y, x)=: indicates that a function performs an action on =x= with =y= modifying the output
+ =type_as_output(x)=: indicates that a function emits output /directly from/ =x=

** Settled Types

+ =fn=: functional helpers
+ =color=: individual colors (of any valid CSS format)
+ =palette=: generated color palettes
+ =ms=: modular scales
+ =tokens=: token collections

** Simple Data Rendering

After fiddling with a lot of approaches for a UI library, I realized that QuarkSuite doesn't really need a full library
so much as ways to render data to a view. =type_as_element= is a new emitter in v2 that indicates the output will be
HTML rendered or a web component.

** WTCG Design Token Spec

I can transition away from my own Quarks System Dictionary spec in favor of [[https://design-tokens.github.io/community-group/format/][adopting an emerging community spec]]. You
love to see it.

** Improved Performance

The library is already pretty fast, but it could be faster. That in itself is enough for me to research ways to squeeze
a little more performance out of everything happening under the hood.

** Internal Simplicity

Up until now, QuarkSuite used some internal patterns and structure that at the time was some pretty clever code. At the
same time, this makes it a bit /too clever to debug effectively/. I'm being more judicious toward complexity and
limiting it to where it's needed.

** Improved Modularity

Where v1 kept its code in a single =mod.js= file, v2 splits the functionality into discrete modules associated with the
available types. This will make it easier to develop and debug while allowing more types to be added in the future.

In addition, the internal library has been expanded so that each utility exposed in the API is truly uncoupled from the
rest. This means that modern build tools, and environments that support tree shaking, will only pull in what's needed.

* Spec

The library begins with an entry point =mod.js= that aggregates all the functionality to make it easier to experiment
during development before you've settled on what you need. QuarkSuite v2 separates all functionality by its input type.

#+BEGIN_SRC js :tangle "./v2/mod.js" :comments both
// Package all utility types

export * as fn from "./fn.js";
export * as color from "./color.js";
export * as ms from "./ms.js";
export * as tokens from "./tokens.js";
#+END_SRC

** API

The API documentation follows specific formatting that will hopefully make it easier to understand.

#+BEGIN_QUOTE
Example:

=name(y, x) => unknown=
+ =y = {}: unknown=: modifier description
+ =x: unknown=: data description
#+END_QUOTE

*** Functional Utilities
:PROPERTIES:
:header-args:js: :tangle "./v2/fn.js" :comments both
:END:

**** fn_process

A functional utility that combines emitters into a process.

+ =fn_process(...emitters) => (x)=
  + =emitters: Array<(x)>=: sequence of emitters to combine

***** fn_process Examples

***** fn_process Implementation

#+BEGIN_SRC js
export function fn_process(...emitters) {
  return compose(...emitters);
}
#+END_SRC

***** fn_process Tests

***** fn_process Errors

**** fn_preset

A functional utility that accepts an action and its modifiers and converts it to an emitter.

+ =fn_preset(action, y) => (x)=
  + =action: (y, x) => unknown=: the action to transform
  + =y: unknown=: the action's associated modifiers

***** fn_preset Examples

***** fn_preset Implementation

#+BEGIN_SRC js
export function fn_preset(action, y) {
  return (x) => action(y, x);
}
#+END_SRC

***** fn_preset Tests

***** fn_preset Errors

**** fn_pipeline

A functional utility that shuttles data =x= through a process pipeline.

+ =fn_pipeline(x, ...processes) => unknown=
  + =x: unknown=: data to pipe
  + =processes: Array<(x)>=: sequence of processes to transform data

***** fn_pipeline Examples

***** fn_pipeline Implementation

#+BEGIN_SRC js
export function fn_pipeline(x, ...processes) {
  return compose(...processes)(x);
}
#+END_SRC

***** fn_pipeline Tests

***** fn_pipeline Errors

*** Color
:PROPERTIES:
:header-args:js: :tangle "./v2/color.js" :comments both
:END:

**** color_adjust

An action that adjusts the =properties= of a given valid CSS =color=. Positive property values will increase while
negative values will decrease.

+ =color_adjust(properties, color) => string=
  - =properties: {}=: the color properties to adjust
    * =properties.lightness = 0: number=: adjust the color's lightness (as a percentage)
    * =properties.chroma = 0: number=: adjust the color's chroma (as a percentage)
    * =properties.hue = 0: number=: adjust the color's hue (in degrees)
    * =properties.alpha = 0: number=: adjust the color's transparency (as a percentage)
  - =color: string=: the color to adjust

***** color_adjust Examples

***** color_adjust Implementation

#+BEGIN_SRC js
export function color_adjust(properties, color) {
  // Do nothing by default
  const { lightness = 0, chroma = 0, hue = 0, alpha = 0 } = properties;

  return colorAdjustment({ lightness, chroma, hue, alpha }, color);
}
#+END_SRC

