Notebook.org
***** color_adjust Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_adjust_test.js"
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_adjust } from "../color.js";

describe("color_adjust(properties, color)", () => {
  it("should reject invalid colors", () => {
    expect(() => color_adjust({}, "invalid")).toThrow();
  });

  it("should correctly adjust lightness of samples", () => {
    expect(color_adjust({ lightness: -25 }, "white")).toBe("#aeaeae");
    expect(color_adjust({ lightness: 25 }, "gray")).toBe("#cdcdcd");
    expect(color_adjust({ lightness: 50 }, "black")).toBe("#636363");
    expect(color_adjust({ lightness: -25 }, "red")).toBe("#a10000");
    expect(color_adjust({ lightness: 10 }, "orange")).toBe("#ffc644");
    expect(color_adjust({ lightness: -16 }, "yellow")).toBe("#cbc900");
    expect(color_adjust({ lightness: -32 }, "lime")).toBe("#009300");
    expect(color_adjust({ lightness: 16 }, "cyan")).toBe("#54ffff");
    expect(color_adjust({ lightness: 32 }, "blue")).toBe("#479dff");
    expect(color_adjust({ lightness: 24 }, "purple")).toBe("#cf5fcc");
    expect(color_adjust({ lightness: -24 }, "magenta")).toBe("#a900ad");
  });

  it("should correctly adjust chroma of samples", () => {
    expect(color_adjust({ chroma: 50 }, "white")).toBe("#ffdbfc");
    expect(color_adjust({ chroma: 50 }, "gray")).toBe("#bb5d7d");
    expect(color_adjust({ chroma: 75 }, "black")).toBe("#060000");
    expect(color_adjust({ chroma: -25 }, "red")).toBe("#e64a3b");
    expect(color_adjust({ chroma: -10 }, "orange")).toBe("#f6a941");
    expect(color_adjust({ chroma: -16 }, "yellow")).toBe("#fcfe66");
    expect(color_adjust({ chroma: -32 }, "lime")).toBe("#71f56a");
    expect(color_adjust({ chroma: -75 }, "cyan")).toBe("#e0e0e0");
    expect(color_adjust({ chroma: 32 }, "blue")).toBe("#1e00ff");
    expect(color_adjust({ chroma: 24 }, "purple")).toBe("#8d008f");
    expect(color_adjust({ chroma: -24 }, "magenta")).toBe("#f04bee");
  });

  it("should correctly adjust hue of samples", () => {
    expect(color_adjust({ hue: 30 }, "white")).toBe("#ffffff");
    expect(color_adjust({ hue: 60 }, "gray")).toBe("#808080");
    expect(color_adjust({ hue: 90 }, "black")).toBe("#000000");
    expect(color_adjust({ hue: 150 }, "red")).toBe("#00b48c");
    expect(color_adjust({ hue: 180 }, "orange")).toBe("#5bc0ff");
    expect(color_adjust({ hue: 210 }, "yellow")).toBe("#ffc2ff");
    expect(color_adjust({ hue: 240 }, "lime")).toBe("#ff6072");
    expect(color_adjust({ hue: 270 }, "cyan")).toBe("#f0e55d");
    expect(color_adjust({ hue: 300 }, "blue")).toBe("#0075a4");
    expect(color_adjust({ hue: 330 }, "purple")).toBe("#5e21a6");
    expect(color_adjust({ hue: 360 }, "magenta")).toBe("#ff00ff");
  });

  it("should correctly adjust alpha of samples", () => {
    expect(color_adjust({ alpha: -10 }, "white")).toBe("#ffffffe6");
    expect(color_adjust({ alpha: -20 }, "gray")).toBe("#808080cc");
    expect(color_adjust({ alpha: -30 }, "black")).toBe("#000000b3");
    expect(color_adjust({ alpha: -40 }, "red")).toBe("#ff000099");
    expect(color_adjust({ alpha: -50 }, "orange")).toBe("#ffa50080");
    expect(color_adjust({ alpha: -60 }, "yellow")).toBe("#ffff0066");
    expect(color_adjust({ alpha: -70 }, "lime")).toBe("#00ff004d");
    expect(color_adjust({ alpha: -80 }, "cyan")).toBe("#00ffff33");
    expect(color_adjust({ alpha: -90 }, "blue")).toBe("#0000ff1a");
    expect(color_adjust({ alpha: -100 }, "purple")).toBe("#80008000");
    expect(color_adjust({ alpha: -110 }, "magenta")).toBe("#ff00ff00");
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_adjust_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_adjust(properties, color)
  • should reject invalid colors
  • should correctly adjust lightness of samples
  • should correctly adjust chroma of samples
  • should correctly adjust hue of samples
  • should correctly adjust alpha of samples

running 5 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_adjust_test.js
test color_adjust(properties, color) > should reject invalid colors ... ok (16ms)
test color_adjust(properties, color) > should correctly adjust lightness of samples ... ok (30ms)
test color_adjust(properties, color) > should correctly adjust chroma of samples ... ok (14ms)
test color_adjust(properties, color) > should correctly adjust hue of samples ... ok (14ms)
test color_adjust(properties, color) > should correctly adjust alpha of samples ... ok (15ms)

test result: ok. 5 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (133ms)

#+end_src

**** color_mix

An action that mixes an input =color= and a =target= color with a set level of =strength=.

+ =color_mix(settings, color) => string=
  - =settings: {}=: the mixture options to set
    * =settings.target = color: string=: set the target (any valid CSS color)
    * =settings.strength = 0: number=: set the strength (as a percentage, negative values reverse the direction)
  - =color: string=: the color to mix

***** color_mix Examples

***** color_mix Implementation

#+BEGIN_SRC js
export function color_mix(settings, color) {
  // Do nothing by default
  const { target = color, strength = 0 } = settings;

  return colorMix(color, target, strength);
}
#+END_SRC

***** color_mix Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_mix_test.js"
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_adjust, color_mix } from "../color.js";

describe("color_mix(settings, color)", () => {
  const samples = [
    ["red", ["#ff0000", "#ff4b00", "#ff6e00", "#ff8b00", "#ffa500"], "orange"],
    [
      "orange",
      ["#ffa500", "#ffbc00", "#ffd200", "#ffe900", "#ffff00"],
      "yellow",
    ],
    ["yellow", ["#ffff00", "#daff00", "#b0ff00", "#7cff00", "#00ff00"], "lime"],
    ["lime", ["#00ff00", "#00ff74", "#00ffa9", "#00ffd6", "#00ffff"], "cyan"],
    ["cyan", ["#00ffff", "#00d1ff", "#00a0ff", "#006aff", "#0000ff"], "blue"],
    ["blue", ["#0000ff", "#381fde", "#5424be", "#6b1e9f", "#800080"], "purple"],
    [
      "purple",
      ["#800080", "#9e009e", "#bd00bd", "#de00de", "#ff00ff"],
      "magenta",
    ],
  ];

  const negations = [
    [
      "red",
      ["#ff0000", "#de5e58", "#b78087", "#8497b2", "#00a9db"],
      color_adjust({ hue: 180 }, "red"),
    ],
    [
      "orange",
      ["#ffa500", "#dfb172", "#bbb9a7", "#92bed4", "#5bc0ff"],
      color_adjust({ hue: 180 }, "orange"),
    ],
    [
      "yellow",
      ["#ffff00", "#fbf77c", "#f8eeb0", "#f6e4da", "#f4d8ff"],
      color_adjust({ hue: 180 }, "yellow"),
    ],
    [
      "lime",
      ["#00ff00", "#8ce77c", "#becbb0", "#e2aada", "#ff7dff"],
      color_adjust({ hue: 180 }, "lime"),
    ],
    [
      "cyan",
      ["#00ffff", "#8beeef", "#bddcdf", "#e2c9cf", "#ffb3bf"],
      color_adjust({ hue: 180 }, "cyan"),
    ],
    [
      "blue",
      ["#0000ff", "#383cc8", "#5e4592", "#803e5a", "#a02000"],
      color_adjust({ hue: 180 }, "blue"),
    ],
    [
      "purple",
      ["#800080", "#6f366a", "#5a4b52", "#3f5a37", "#006600"],
      color_adjust({ hue: 180 }, "purple"),
    ],
    [
      "magenta",
      ["#ff00ff", "#de72d5", "#b79ba9", "#85b774", "#00cd00"],
      color_adjust({ hue: 180 }, "magenta"),
    ],
  ];

  it("should reject an invalid color", () => {
    expect(() => color_mix({ target: "blue" }, "invalid")).toThrow();
  });

  it("should reject an invalid target", () => {
    expect(() => color_mix({ target: "invalid" }, "red")).toThrow();
  });

  it("should correctly mix samples", () => {
    samples.forEach(([color, results, target]) => {
      results.forEach((output, index) => {
        expect(color_mix({ target, strength: index * 25 }, color)).toBe(output);
      });
    });
  });

  it("should correctly negate opposites", () => {
    negations.forEach(([color, results, target]) => {
      results.forEach((output, index) => {
        expect(color_mix({ target, strength: index * 25 }, color)).toBe(output);
      });
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_mix_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_mix(settings, color)
  • should reject an invalid color
  • should reject an invalid target
  • should correctly mix samples
  • should correctly negate opposites

running 4 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_mix_test.js
test color_mix(settings, color) > should reject an invalid color ... ok (12ms)
test color_mix(settings, color) > should reject an invalid target ... ok (6ms)
test color_mix(settings, color) > should correctly mix samples ... ok (46ms)
test color_mix(settings, color) > should correctly negate opposites ... ok (53ms)

test result: ok. 4 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (189ms)

#+end_src

**** color_as_hex

An emitter that accepts a valid CSS =color= and outputs its hexadecimal equivalent.

+ =color_as_hex(color) => string=
  + =color: string=: the color to convert

***** color_as_hex Examples

***** color_as_hex Implementation

#+BEGIN_SRC js
export function color_as_hex(color) {
  return serializeHex(convert(color, "hex"));
}
#+END_SRC

