Notebook.org
***** color_as_hex Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_hex_test.js" :comments both
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_hex } from "../color.js";

describe("color_as_hex(color)", () => {
  const controlGroup = [
    ["black", "#000000"],
    ["gray", "#808080"],
    ["white", "#ffffff"],
  ];

  const samples = [
    ["red", "#ff0000"],
    ["orange", "#ffa500"],
    ["yellow", "#ffff00"],
    ["lime", "#00ff00"],
    ["cyan", "#00ffff"],
    ["blue", "#0000ff"],
    ["purple", "#800080"],
    ["magenta", "#ff00ff"],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_hex("invalid")).toThrow();
  });

  it("should correctly convert the control group", () => {
    controlGroup.forEach(([input, output]) => {
      expect(color_as_hex(input)).toBe(output);
    });
  });
  it("should correctly convert the color samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_hex(input)).toBe(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_hex_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_hex(color)
  • should reject invalid colors
  • should correctly convert the control group
  • should correctly convert the color samples

running 3 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_hex_test.js
test color_as_hex(color) > should reject invalid colors ... ok (14ms)
test color_as_hex(color) > should correctly convert the control group ... ok (14ms)
test color_as_hex(color) > should correctly convert the color samples ... ok (13ms)

test result: ok. 3 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (87ms)

#+end_src

**** color_as_rgb

An emitter that accepts a valid CSS =color= and outputs its RGB equivalent.

+ =color_as_rgb(color) => string=
  + =color: string=: the color to convert

***** color_as_rgb Examples

***** color_as_rgb Implementation

#+BEGIN_SRC js
export function color_as_rgb(color) {
  return serializeRgb(convert(color, "rgb"));
}
#+END_SRC

***** color_as_rgb Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_rgb_test.js" :comments both
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_rgb } from "../color.js";

describe("color_as_rgb(color)", () => {
  const controlGroup = [
    ["black", "rgb(0, 0, 0)"],
    ["gray", "rgb(128, 128, 128)"],
    ["white", "rgb(255, 255, 255)"],
  ];

  const samples = [
    ["red", "rgb(255, 0, 0)"],
    ["orange", "rgb(255, 165, 0)"],
    ["yellow", "rgb(255, 255, 0)"],
    ["lime", "rgb(0, 255, 0)"],
    ["cyan", "rgb(0, 255, 255)"],
    ["blue", "rgb(0, 0, 255)"],
    ["purple", "rgb(128, 0, 128)"],
    ["magenta", "rgb(255, 0, 255)"],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_rgb("invalid")).toThrow();
  });

  it("should correctly convert the control group", () => {
    controlGroup.forEach(([input, output]) => {
      expect(color_as_rgb(input)).toBe(output);
    });
  });
  it("should correctly convert the color samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_rgb(input)).toBe(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_rgb_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_rgb(color)
  • should reject invalid colors
  • should correctly convert the control group
  • should correctly convert the color samples

running 3 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_rgb_test.js
test color_as_rgb(color) > should reject invalid colors ... ok (14ms)
test color_as_rgb(color) > should correctly convert the control group ... ok (14ms)
test color_as_rgb(color) > should correctly convert the color samples ... ok (14ms)

test result: ok. 3 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (87ms)

#+end_src

**** color_as_hsl

An emitter that accepts a valid CSS =color= and outputs its HSL equivalent.

+ =color_as_hsl(color) => string=
  + =color: string=: the color to convert

***** color_as_hsl Examples

***** color_as_hsl Implementation

#+BEGIN_SRC js
export function color_as_hsl(color) {
  return serializeHsl(convert(color, "hsl"));
}
#+END_SRC

***** color_as_hsl Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_hsl_test.js" :comments both
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_hsl } from "../color.js";

describe("color_as_hsl(color)", () => {
  const controlGroup = [
    ["black", "hsl(0, 0%, 0%)"],
    ["gray", "hsl(0, 0%, 50.196%)"],
    ["white", "hsl(0, 0%, 100%)"],
  ];

  const samples = [
    ["red", "hsl(0, 100%, 50%)"],
    ["orange", "hsl(38.824, 100%, 50%)"],
    ["yellow", "hsl(60, 100%, 50%)"],
    ["lime", "hsl(120, 100%, 50%)"],
    ["cyan", "hsl(180, 100%, 50%)"],
    ["blue", "hsl(240, 100%, 50%)"],
    ["purple", "hsl(300, 100%, 25.098%)"],
    ["magenta", "hsl(300, 100%, 50%)"],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_hsl("invalid")).toThrow();
  });

  it("should correctly convert the control group", () => {
    controlGroup.forEach(([input, output]) => {
      expect(color_as_hsl(input)).toBe(output);
    });
  });
  it("should correctly convert the color samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_hsl(input)).toBe(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_hsl_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_hsl(color)
  • should reject invalid colors
  • should correctly convert the control group
  • should correctly convert the color samples

running 3 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_hsl_test.js
test color_as_hsl(color) > should reject invalid colors ... ok (16ms)
test color_as_hsl(color) > should correctly convert the control group ... ok (14ms)
test color_as_hsl(color) > should correctly convert the color samples ... ok (15ms)

test result: ok. 3 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (90ms)

#+end_src

**** color_as_cmyk

An emitter that accepts a valid CSS =color= and outputs its CMYK equivalent.

+ =color_as_cmyk(color) => string=
  + =color: string=: the color to convert

***** color_as_cmyk Examples

***** color_as_cmyk Implementation

#+BEGIN_SRC js
export function color_as_cmyk(color) {
  return serializeCmyk(convert(color, "cmyk"));
}
#+END_SRC

***** color_as_cmyk Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_cmyk_test.js" :comments both
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_cmyk } from "../color.js";

describe("color_as_cmyk(color)", () => {
  const controlGroup = [
    ["black", "device-cmyk(0% 0% 0% 100%)"],
    ["gray", "device-cmyk(0% 0% 0% 49.804%)"],
    ["white", "device-cmyk(0% 0% 0% 0%)"],
  ];

  const samples = [
    ["red", "device-cmyk(0% 100% 100% 0%)"],
    ["orange", "device-cmyk(0% 35.294% 100% 0%)"],
    ["yellow", "device-cmyk(0% 0% 100% 0%)"],
    ["lime", "device-cmyk(100% 0% 100% 0%)"],
    ["cyan", "device-cmyk(100% 0% 0% 0%)"],
    ["blue", "device-cmyk(100% 100% 0% 0%)"],
    ["purple", "device-cmyk(0% 100% 0% 49.804%)"],
    ["magenta", "device-cmyk(0% 100% 0% 0%)"],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_cmyk("invalid")).toThrow();
  });

  it("should correctly convert the control group", () => {
    controlGroup.forEach(([input, output]) => {
      expect(color_as_cmyk(input)).toBe(output);
    });
  });
  it("should correctly convert the color samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_cmyk(input)).toBe(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_cmyk_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_cmyk(color)
  • should reject invalid colors
  • should correctly convert the control group
  • should correctly convert the color samples

running 3 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_cmyk_test.js
test color_as_cmyk(color) > should reject invalid colors ... ok (15ms)
test color_as_cmyk(color) > should correctly convert the control group ... ok (14ms)
test color_as_cmyk(color) > should correctly convert the color samples ... ok (13ms)

test result: ok. 3 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (89ms)

#+end_src

**** color_as_hwb

An emitter that accepts a valid CSS =color= and outputs its HWB equivalent.

+ =color_as_hwb(color) => string=
  + =color: string=: the color to convert

***** color_as_hwb Examples

***** color_as_hwb Implementation

#+BEGIN_SRC js
export function color_as_hwb(color) {
  return serializeHwb(convert(color, "hwb"));
}
#+END_SRC

