Notebook.org
***** color_as_hwb Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_hwb_test.js" :comments both
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_hwb } from "../color.js";

describe("color_as_hwb(color)", () => {
  const controlGroup = [
    ["black", "hwb(0 0% 100%)"],
    ["gray", "hwb(0 50.196% 49.804%)"],
    ["white", "hwb(0 100% 0%)"],
  ];

  const samples = [
    ["red", "hwb(0 0% 0%)"],
    ["orange", "hwb(38.824 0% 0%)"],
    ["yellow", "hwb(60 0% 0%)"],
    ["lime", "hwb(120 0% 0%)"],
    ["cyan", "hwb(180 0% 0%)"],
    ["blue", "hwb(240 0% 0%)"],
    ["purple", "hwb(300 0% 49.804%)"],
    ["magenta", "hwb(300 0% 0%)"],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_hwb("invalid")).toThrow();
  });

  it("should correctly convert the control group", () => {
    controlGroup.forEach(([input, output]) => {
      expect(color_as_hwb(input)).toBe(output);
    });
  });
  it("should correctly convert the color samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_hwb(input)).toBe(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_hwb_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_hwb(color)
  • should reject invalid colors
  • should correctly convert the control group
  • should correctly convert the color samples

running 3 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_hwb_test.js
test color_as_hwb(color) > should reject invalid colors ... ok (16ms)
test color_as_hwb(color) > should correctly convert the control group ... ok (14ms)
test color_as_hwb(color) > should correctly convert the color samples ... ok (14ms)

test result: ok. 3 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (88ms)

#+end_src
**** color_as_cielab

An emitter that accepts a valid CSS =color= and outputs its CIELAB equivalent.

+ =color_as_cielab(color) => string=
  + =color: string=: the color to convert

***** color_as_cielab Examples

***** color_as_cielab Implementation

#+BEGIN_SRC js
export function color_as_cielab(color) {
  return serializeCielab(convert(color, "cielab"));
}
#+END_SRC

***** color_as_cielab Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_cielab_test.js" :comments both
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_cielab } from "../color.js";

describe("color_as_cielab(color)", () => {
  const controlGroup = [
    ["black", "lab(0% 0 0)"],
    ["gray", "lab(53.585% 0 0)"],
    ["white", "lab(100% 0 0)"],
  ];

  const samples = [
    ["red", "lab(54.292% 80.812 69.885)"],
    ["orange", "lab(75.59% 27.519 79.116)"],
    ["yellow", "lab(97.607% -15.753 93.388)"],
    ["lime", "lab(87.818% -79.287 80.99)"],
    ["cyan", "lab(90.665% -50.665 -14.962)"],
    ["blue", "lab(29.568% 68.299 -112.029)"],
    ["purple", "lab(29.692% 56.118 -36.291)"],
    ["magenta", "lab(60.17% 93.55 -60.499)"],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_cielab("invalid")).toThrow();
  });

  it("should correctly convert the control group", () => {
    controlGroup.forEach(([input, output]) => {
      expect(color_as_cielab(input)).toBe(output);
    });
  });
  it("should correctly convert the color samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_cielab(input)).toBe(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_cielab_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_cielab(color)
  • should reject invalid colors
  • should correctly convert the control group
  • should correctly convert the color samples

running 3 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_cielab_test.js
test color_as_cielab(color) > should reject invalid colors ... ok (14ms)
test color_as_cielab(color) > should correctly convert the control group ... ok (14ms)
test color_as_cielab(color) > should correctly convert the color samples ... ok (14ms)

test result: ok. 3 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (87ms)

#+end_src

**** color_as_cielch

An emitter that accepts a valid CSS =color= and outputs its CIELCH equivalent.

+ =color_as_cielch(color) => string=
  + =color: string=: the color to convert

***** color_as_cielch Examples

***** color_as_cielch Implementation

#+BEGIN_SRC js
export function color_as_cielch(color) {
  return serializeCielch(convert(color, "cielch"));
}
#+END_SRC

***** color_as_cielch Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_cielch_test.js" :comments both
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_cielch } from "../color.js";

describe("color_as_cielch(color)", () => {
  const controlGroup = [
    ["black", "lch(0% 0 0)"],
    ["gray", "lch(53.585% 0 0)"],
    ["white", "lch(100% 0 0)"],
  ];

  const samples = [
    ["red", "lch(54.292% 106.839 40.853)"],
    ["orange", "lch(75.59% 83.766 70.821)"],
    ["yellow", "lch(97.607% 94.708 99.575)"],
    ["lime", "lch(87.818% 113.34 134.391)"],
    ["cyan", "lch(90.665% 52.828 196.452)"],
    ["blue", "lch(29.568% 131.207 301.369)"],
    ["purple", "lch(29.692% 66.83 327.109)"],
    ["magenta", "lch(60.17% 111.408 327.109)"],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_cielch("invalid")).toThrow();
  });

  it("should correctly convert the control group", () => {
    controlGroup.forEach(([input, output]) => {
      expect(color_as_cielch(input)).toBe(output);
    });
  });
  it("should correctly convert the color samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_cielch(input)).toBe(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_cielch_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_cielch(color)
  • should reject invalid colors
  • should correctly convert the control group
  • should correctly convert the color samples

running 3 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_cielch_test.js
test color_as_cielch(color) > should reject invalid colors ... ok (14ms)
test color_as_cielch(color) > should correctly convert the control group ... ok (14ms)
test color_as_cielch(color) > should correctly convert the color samples ... ok (14ms)

test result: ok. 3 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (88ms)

#+end_src

**** color_as_oklab

An emitter that accepts a valid CSS =color= and outputs its OKLab equivalent.

+ =color_as_oklab(color) => string=
  + =color: string=: the color to convert

***** color_as_oklab Examples

***** color_as_oklab Implementation

#+BEGIN_SRC js
export function color_as_oklab(color) {
  return serializeOklab(convert(color, "oklab"));
}
#+END_SRC

***** color_as_oklab Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_oklab_test.js" :comments both
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_oklab } from "../color.js";

describe("color_as_oklab(color)", () => {
  const controlGroup = [
    ["black", "oklab(0% 0 0)"],
    ["gray", "oklab(59.987% 0 0)"],
    ["white", "oklab(100% 0 0)"],
  ];

  const samples = [
    ["red", "oklab(62.796% 0.22486 0.12585)"],
    ["orange", "oklab(79.269% 0.05661 0.16138)"],
    ["yellow", "oklab(96.798% -0.07137 0.19857)"],
    ["lime", "oklab(86.644% -0.23389 0.1795)"],
    ["cyan", "oklab(90.54% -0.14944 -0.0394)"],
    ["blue", "oklab(45.201% -0.03246 -0.31153)"],
    ["purple", "oklab(42.091% 0.1647 -0.10147)"],
    ["magenta", "oklab(70.167% 0.27457 -0.16916)"],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_oklab("invalid")).toThrow();
  });

  it("should correctly convert the control group", () => {
    controlGroup.forEach(([input, output]) => {
      expect(color_as_oklab(input)).toBe(output);
    });
  });
  it("should correctly convert the color samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_oklab(input)).toBe(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_oklab_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_oklab(color)
  • should reject invalid colors
  • should correctly convert the control group
  • should correctly convert the color samples

running 3 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_oklab_test.js
test color_as_oklab(color) > should reject invalid colors ... ok (15ms)
test color_as_oklab(color) > should correctly convert the control group ... ok (14ms)
test color_as_oklab(color) > should correctly convert the color samples ... ok (14ms)

test result: ok. 3 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (88ms)

#+end_src
**** color_as_oklch

An emitter that accepts a valid CSS =color= and outputs its OKLCH equivalent.

+ =color_as_oklch(color) => string=
  + =color: string=: the color to convert

***** color_as_oklch Examples

***** color_as_oklch Implementation

#+BEGIN_SRC js
export function color_as_oklch(color) {
  return serializeOklch(convert(color, "oklch"));
}
#+END_SRC

***** color_as_oklch Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_oklch_test.js" :comments both
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_oklch } from "../color.js";

describe("color_as_oklch(color)", () => {
  const controlGroup = [
    ["black", "oklch(0% 0 0)"],
    ["gray", "oklch(59.987% 0 0)"],
    ["white", "oklch(100% 0 0)"],
  ];

  const samples = [
    ["red", "oklch(62.796% 0.25768 29.234)"],
    ["orange", "oklch(79.269% 0.17103 70.67)"],
    ["yellow", "oklch(96.798% 0.21101 109.769)"],
    ["lime", "oklch(86.644% 0.29483 142.495)"],
    ["cyan", "oklch(90.54% 0.15455 194.769)"],
    ["blue", "oklch(45.201% 0.31321 264.052)"],
    ["purple", "oklch(42.091% 0.19345 328.363)"],
    ["magenta", "oklch(70.167% 0.32249 328.363)"],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_oklch("invalid")).toThrow();
  });

  it("should correctly convert the control group", () => {
    controlGroup.forEach(([input, output]) => {
      expect(color_as_oklch(input)).toBe(output);
    });
  });
  it("should correctly convert the color samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_oklch(input)).toBe(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_oklch_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_oklch(color)
  • should reject invalid colors
  • should correctly convert the control group
  • should correctly convert the color samples

running 3 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_oklch_test.js
test color_as_oklch(color) > should reject invalid colors ... ok (15ms)
test color_as_oklch(color) > should correctly convert the control group ... ok (14ms)
test color_as_oklch(color) > should correctly convert the color samples ... ok (14ms)

test result: ok. 3 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (88ms)

#+end_src

**** color_as_dyad

An emitter that accepts any valid CSS color and outputs a dyadic color scheme.

+ =color_as_dyad(color) => [string, string]=
  - =color: string=: the input color

***** color_as_dyad Examples

***** color_as_dyad Implementation

#+BEGIN_SRC js
export function color_as_dyad(color) {
  return [
    colorAdjustment({ hue: 0 }, color),
    colorAdjustment({ hue: 90 }, color),
  ];
}
#+END_SRC

