Notebook.org
***** color_as_dyad Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_dyad_test.js"
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_dyad } from "../color.js";

describe("color_as_dyad(color)", () => {
  const samples = [
    ["red", ["#ff0000", "#7b9900"]],
    ["orange", ["#ffa500", "#23dc96"]],
    ["yellow", ["#ffff00", "#00ffff"]],
    ["lime", ["#00ff00", "#00e9ff"]],
    ["cyan", ["#00ffff", "#d5d0ff"]],
    ["blue", ["#0000ff", "#c00061"]],
    ["purple", ["#800080", "#931700"]],
    ["magenta", ["#ff00ff", "#ff3800"]],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_dyad("invalid")).toThrow();
  });

  it("should correctly emit dyads from samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_dyad(input)).toEqual(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_dyad_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_dyad(color)
  • should reject invalid colors
  • should correctly emit dyads from samples

running 2 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_dyad_test.js
test color_as_dyad(color) > should reject invalid colors ... ok (23ms)
test color_as_dyad(color) > should correctly emit dyads from samples ... ok (40ms)

test result: ok. 2 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (109ms)

#+end_src

**** color_as_complementary

An emitter that accepts any valid CSS color and outputs a complementary color scheme.

+ =color_as_complementary(color) => [string, string]=
  - =color: string=: the input color

***** color_as_complementary Examples

***** color_as_complementary Implementation

#+BEGIN_SRC js
export function color_as_complementary(color) {
  return [
    colorAdjustment({ hue: 0 }, color),
    colorAdjustment({ hue: 180 }, color),
  ];
}
#+END_SRC

***** color_as_complementary Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_complementary_test.js"
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_complementary } from "../color.js";

describe("color_as_complementary(color)", () => {
  const samples = [
    ["red", ["#ff0000", "#00a9db"]],
    ["orange", ["#ffa500", "#5bc0ff"]],
    ["yellow", ["#ffff00", "#f4d8ff"]],
    ["lime", ["#00ff00", "#ff7dff"]],
    ["cyan", ["#00ffff", "#ffb3bf"]],
    ["blue", ["#0000ff", "#a02000"]],
    ["purple", ["#800080", "#006600"]],
    ["magenta", ["#ff00ff", "#00cd00"]],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_complementary("invalid")).toThrow();
  });

  it("should correctly emit complementary schemes from samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_complementary(input)).toEqual(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_complementary_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_complementary(color)
  • should reject invalid colors
  • should correctly emit complementary schemes from samples

running 2 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_complementary_test.js
test color_as_complementary(color) > should reject invalid colors ... ok (14ms)
test color_as_complementary(color) > should correctly emit complementary schemes from samples ... ok (37ms)

test result: ok. 2 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (96ms)

#+end_src

**** color_as_analogous

An emitter that accepts any valid CSS color and outputs an analogous color scheme.

+ =color_as_analogous(color) => [string, string, string]=
  - =color: string=: the input color

***** color_as_analogous Examples

***** color_as_analogous Implementation

#+BEGIN_SRC js
export function color_as_analogous(color) {
  return [
    colorAdjustment({ hue: 0 }, color),
    colorAdjustment({ hue: 45 }, color),
    colorAdjustment({ hue: 45 * 2 }, color),
  ];
}
#+END_SRC

***** color_as_analogous Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_analogous_test.js"
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_analogous } from "../color.js";

describe("color_as_analogous(color)", () => {
  const samples = [
    ["red", ["#ff0000", "#de5f00", "#7b9900"]],
    ["orange", ["#ffa500", "#b7c826", "#23dc96"]],
    ["yellow", ["#ffff00", "#5bffb3", "#00ffff"]],
    ["lime", ["#00ff00", "#00fff5", "#00e9ff"]],
    ["cyan", ["#00ffff", "#72edff", "#d5d0ff"]],
    ["blue", ["#0000ff", "#8800d3", "#c00061"]],
    ["purple", ["#800080", "#9b002d", "#931700"]],
    ["magenta", ["#ff00ff", "#ff0061", "#ff3800"]],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_analogous("invalid")).toThrow();
  });

  it("should correctly emit analogous schemes from samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_analogous(input)).toEqual(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_analogous_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_analogous(color)
  • should reject invalid colors
  • should correctly emit analogous schemes from samples

running 2 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_analogous_test.js
test color_as_analogous(color) > should reject invalid colors ... ok (16ms)
test color_as_analogous(color) > should correctly emit analogous schemes from samples ... ok (42ms)

test result: ok. 2 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (103ms)

#+end_src

**** color_as_split

An emitter that accepts any valid CSS color and outputs a split complementary color scheme.

+ =color_as_split(color) => [string, string, string]=
  - =color: string=: the input color

***** color_as_split Examples

***** color_as_split Implementation

#+BEGIN_SRC js
export function color_as_split(color) {
  return [
    colorAdjustment({ hue: 0 }, color),
    colorAdjustment({ hue: 180 - 30 }, color),
    colorAdjustment({ hue: 180 + 30 }, color),
  ];
}
#+END_SRC

***** color_as_split Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_split_test.js"
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_split } from "../color.js";

describe("color_as_split(color)", () => {
  const samples = [
    ["red", ["#ff0000", "#00b48c", "#0090ff"]],
    ["orange", ["#ffa500", "#00d2ff", "#a9acff"]],
    ["yellow", ["#ffff00", "#9cf3ff", "#ffc2ff"]],
    ["lime", ["#00ff00", "#df9eff", "#ff62e5"]],
    ["cyan", ["#00ffff", "#ffb4f8", "#ffbd87"]],
    ["blue", ["#0000ff", "#c50000", "#5d5c00"]],
    ["purple", ["#800080", "#475700", "#006a4e"]],
    ["magenta", ["#ff00ff", "#92b100", "#00d5a0"]],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_split("invalid")).toThrow();
  });

  it("should correctly emit split complementary schemes from samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_split(input)).toEqual(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_split_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_split(color)
  • should reject invalid colors
  • should correctly emit split complementary schemes from samples

running 2 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_split_test.js
test color_as_split(color) > should reject invalid colors ... ok (16ms)
test color_as_split(color) > should correctly emit split complementary schemes from samples ... ok (42ms)

test result: ok. 2 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (104ms)

#+end_src

**** color_as_clash


An emitter that accepts any valid CSS color and outputs a clash color scheme.

+ =color_as_clash(color) => [string, string, string]=
  - =color: string=: the input color

***** color_as_clash Examples

***** color_as_clash Implementation

#+BEGIN_SRC js
export function color_as_clash(color) {
  return [
    colorAdjustment({ hue: 0 }, color),
    colorAdjustment({ hue: 90 }, color),
    colorAdjustment({ hue: 90 * 3 }, color),
  ];
}
#+END_SRC

***** color_as_clash Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_clash_test.js"
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_clash } from "../color.js";

describe("color_as_clash(color)", () => {
  const samples = [
    ["red", ["#ff0000", "#7b9900", "#a34fff"]],
    ["orange", ["#ffa500", "#23dc96", "#ff8cdc"]],
    ["yellow", ["#ffff00", "#00ffff", "#ffb3b9"]],
    ["lime", ["#00ff00", "#00e9ff", "#ff8300"]],
    ["cyan", ["#00ffff", "#d5d0ff", "#f0e55d"]],
    ["blue", ["#0000ff", "#c00061", "#008048"]],
    ["purple", ["#800080", "#931700", "#0051a8"]],
    ["magenta", ["#ff00ff", "#ff3800", "#00a6ff"]],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_clash("invalid")).toThrow();
  });

  it("should correctly emit clashing schemes from samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_clash(input)).toEqual(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_clash_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_clash(color)
  • should reject invalid colors
  • should correctly emit clashing schemes from samples

running 2 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_clash_test.js
test color_as_clash(color) > should reject invalid colors ... ok (15ms)
test color_as_clash(color) > should correctly emit clashing schemes from samples ... ok (42ms)

test result: ok. 2 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (104ms)

#+end_src

**** color_as_triad

An emitter that accepts any valid CSS color and outputs a triadic color scheme.

+ =color_as_triad(color) => [string, string, string]=
  - =color: string=: the input color

***** color_as_triad Examples

***** color_as_triad Implementation

#+BEGIN_SRC js
export function color_as_triad(color) {
  return [
    colorAdjustment({ hue: 0 }, color),
    colorAdjustment({ hue: 120 }, color),
    colorAdjustment({ hue: 120 * 2 }, color),
  ];
}
#+END_SRC

