Notebook.org
***** color_as_triad Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_triad_test.js"
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_triad } from "../color.js";

describe("color_as_triad(color)", () => {
  const samples = [
    ["red", ["#ff0000", "#00ae00", "#4f6fff"]],
    ["orange", ["#ffa500", "#00dcd5", "#de99ff"]],
    ["yellow", ["#ffff00", "#00ffff", "#ffb3ff"]],
    ["lime", ["#00ff00", "#61c4ff", "#ff6072"]],
    ["cyan", ["#00ffff", "#ffbfff", "#ffd05c"]],
    ["blue", ["#0000ff", "#ce0000", "#007700"]],
    ["purple", ["#800080", "#773e00", "#006384"]],
    ["magenta", ["#ff00ff", "#ef8200", "#00c8ff"]],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_triad("invalid")).toThrow();
  });

  it("should correctly emit triadic schemes from samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_triad(input)).toEqual(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_triad_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_triad(color)
  • should reject invalid colors
  • should correctly emit triadic schemes from samples

running 2 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_triad_test.js
test color_as_triad(color) > should reject invalid colors ... ok (16ms)
test color_as_triad(color) > should correctly emit triadic schemes from samples ... ok (43ms)

test result: ok. 2 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (105ms)

#+end_src

**** color_as_tetrad

An emitter that accepts any valid CSS color and outputs a tetradic color scheme.

+ =color_as_tetrad(color) => [string, string, string, string]=
  - =color: string=: the input color

***** color_as_tetrad Examples

***** color_as_tetrad Implementation

#+BEGIN_SRC js
export function color_as_tetrad(color) {
  return [
    colorAdjustment({ hue: 0 }, color),
    colorAdjustment({ hue: 45 }, color),
    colorAdjustment({ hue: 180 }, color),
    colorAdjustment({ hue: 180 + 45 }, color),
  ];
}
#+END_SRC

***** color_as_tetrad Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_tetrad_test.js"
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_tetrad } from "../color.js";

describe("color_as_tetrad(color)", () => {
  const samples = [
    ["red", ["#ff0000", "#de5f00", "#00a9db", "#0080ff"]],
    ["orange", ["#ffa500", "#b7c826", "#5bc0ff", "#c5a2ff"]],
    ["yellow", ["#ffff00", "#5bffb3", "#f4d8ff", "#ffb9ff"]],
    ["lime", ["#00ff00", "#00fff5", "#ff7dff", "#ff5cb0"]],
    ["cyan", ["#00ffff", "#72edff", "#ffb3bf", "#ffc56e"]],
    ["blue", ["#0000ff", "#8800d3", "#a02000", "#016c00"]],
    ["purple", ["#800080", "#9b002d", "#006600", "#00686b"]],
    ["magenta", ["#ff00ff", "#ff0061", "#00cd00", "#00d1d7"]],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_tetrad("invalid")).toThrow();
  });

  it("should correctly emit tetradic schemes from samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_tetrad(input)).toEqual(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_tetrad_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_tetrad(color)
  • should reject invalid colors
  • should correctly emit tetradic schemes from samples

running 2 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_tetrad_test.js
test color_as_tetrad(color) > should reject invalid colors ... ok (16ms)
test color_as_tetrad(color) > should correctly emit tetradic schemes from samples ... ok (48ms)

test result: ok. 2 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (111ms)

#+end_src

**** color_as_square

An emitter that accepts any valid CSS color and outputs a square color scheme.

+ =color_as_square(color) => [string, string, string, string]=
  - =color: string=: the input color

***** color_as_square Examples

***** color_as_square Implementation

#+BEGIN_SRC js
export function color_as_square(color) {
  return [
    colorAdjustment({ hue: 0 }, color),
    colorAdjustment({ hue: 90 }, color),
    colorAdjustment({ hue: 90 * 2 }, color),
    colorAdjustment({ hue: 90 * 3 }, color),
  ];
}
#+END_SRC

***** color_as_square Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_square_test.js"
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_square } from "../color.js";

describe("color_as_square(color)", () => {
  const samples = [
    ["red", ["#ff0000", "#7b9900", "#00a9db", "#a34fff"]],
    ["orange", ["#ffa500", "#23dc96", "#5bc0ff", "#ff8cdc"]],
    ["yellow", ["#ffff00", "#00ffff", "#f4d8ff", "#ffb3b9"]],
    ["lime", ["#00ff00", "#00e9ff", "#ff7dff", "#ff8300"]],
    ["cyan", ["#00ffff", "#d5d0ff", "#ffb3bf", "#f0e55d"]],
    ["blue", ["#0000ff", "#c00061", "#a02000", "#008048"]],
    ["purple", ["#800080", "#931700", "#006600", "#0051a8"]],
    ["magenta", ["#ff00ff", "#ff3800", "#00cd00", "#00a6ff"]],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_square("invalid")).toThrow();
  });

  it("should correctly emit square schemes from samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_square(input)).toEqual(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_square_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_square(color)
  • should reject invalid colors
  • should correctly emit square schemes from samples

running 2 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_square_test.js
test color_as_square(color) > should reject invalid colors ... ok (16ms)
test color_as_square(color) > should correctly emit square schemes from samples ... ok (48ms)

test result: ok. 2 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (109ms)

#+end_src

**** color_as_star

An emitter that accepts any valid CSS color and outputs a star color scheme.

+ =color_as_star(color) => [string, string, string, string, string]=
  - =color: string=: the input color

***** color_as_star Examples

***** color_as_star Implementation

#+BEGIN_SRC js
export function color_as_star(color) {
  return [
    colorAdjustment({ hue: 0 }, color),
    colorAdjustment({ hue: 72 }, color),
    colorAdjustment({ hue: 72 * 2 }, color),
    colorAdjustment({ hue: 72 * 3 }, color),
    colorAdjustment({ hue: 72 * 4 }, color),
  ];
}
#+END_SRC

***** color_as_star Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_star_test.js"
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_star } from "../color.js";

describe("color_as_star(color)", () => {
  const samples = [
    ["red", ["#ff0000", "#ac8500", "#00b47a", "#008aff", "#c43deb"]],
    ["orange", ["#ffa500", "#73d66d", "#00d5ff", "#b5a8ff", "#ff88ba"]],
    ["yellow", ["#ffff00", "#00ffff", "#85f8ff", "#ffbeff", "#ffbb85"]],
    ["lime", ["#00ff00", "#00faff", "#cca5ff", "#ff5fd1", "#ffa000"]],
    ["cyan", ["#00ffff", "#b1dcff", "#ffb6ff", "#ffc07c", "#cdf076"]],
    ["blue", ["#0000ff", "#ad0094", "#c90000", "#476300", "#007c82"]],
    ["purple", ["#800080", "#9a0000", "#535300", "#00695a", "#0043b3"]],
    ["magenta", ["#ff00ff", "#ff0000", "#aaa900", "#00d4b7", "#008cff"]],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_star("invalid")).toThrow();
  });

  it("should correctly emit star schemes from samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_star(input)).toEqual(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_star_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_star(color)
  • should reject invalid colors
  • should correctly emit star schemes from samples

running 2 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_star_test.js
test color_as_star(color) > should reject invalid colors ... ok (15ms)
test color_as_star(color) > should correctly emit star schemes from samples ... ok (54ms)

test result: ok. 2 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (115ms)

#+end_src

**** color_as_hexagon

An emitter that accepts any valid CSS color and outputs a hexagon color scheme.

+ =color_as_hexagon(color) => [string, string, string, string, string]=
  - =color: string=: the input color

***** color_as_hexagon Examples

***** color_as_hexagon Implementation

#+BEGIN_SRC js
export function color_as_hexagon(color) {
  return [
    colorAdjustment({ hue: 0 }, color),
    colorAdjustment({ hue: 60 }, color),
    colorAdjustment({ hue: 60 * 2 }, color),
    colorAdjustment({ hue: 60 * 3 }, color),
    colorAdjustment({ hue: 60 * 4 }, color),
    colorAdjustment({ hue: 60 * 5 }, color),
  ];
}
#+END_SRC

***** color_as_hexagon Tests

#+BEGIN_SRC js :tangle "./v2/tests/color_as_hexagon_test.js"
import { describe, expect, it, run } from "https://deno.land/x/tincan/mod.ts";
import { color_as_hexagon } from "../color.js";

describe("color_as_hexagon(color)", () => {
  const samples = [
    ["red", ["#ff0000", "#c57500", "#00ae00", "#00a9db", "#4f6fff", "#d62fd2"]],
    [
      "orange",
      ["#ffa500", "#95d150", "#00dcd5", "#5bc0ff", "#de99ff", "#ff88a1"],
    ],
    [
      "yellow",
      ["#ffff00", "#00ffde", "#00ffff", "#f4d8ff", "#ffb3ff", "#ffc461"],
    ],
    [
      "lime",
      ["#00ff00", "#00ffff", "#61c4ff", "#ff7dff", "#ff6072", "#ffb400"],
    ],
    [
      "cyan",
      ["#00ffff", "#96e3ff", "#ffbfff", "#ffb3bf", "#ffd05c", "#b3f78b"],
    ],
    [
      "blue",
      ["#0000ff", "#9e00b2", "#ce0000", "#a02000", "#007700", "#0075a4"],
    ],
    [
      "purple",
      ["#800080", "#9c0000", "#773e00", "#006600", "#006384", "#253ab4"],
    ],
    [
      "magenta",
      ["#ff00ff", "#ff0000", "#ef8200", "#00cd00", "#00c8ff", "#527aff"],
    ],
  ];

  it("should reject invalid colors", () => {
    expect(() => color_as_hexagon("invalid")).toThrow();
  });

  it("should correctly emit hexagon schemes from samples", () => {
    samples.forEach(([input, output]) => {
      expect(color_as_hexagon(input)).toEqual(output);
    });
  });
});

run();
#+END_SRC

#+BEGIN_SRC shell
NO_COLOR=1 deno test v2/tests/color_as_hexagon_test.js
#+END_SRC

#+RESULTS:
#+begin_src shell

  color_as_hexagon(color)
  • should reject invalid colors
  • should correctly emit hexagon schemes from samples

running 2 tests from file:///home/cr-jr/Code/quarksuite:core/v2/tests/color_as_hexagon_test.js
test color_as_hexagon(color) > should reject invalid colors ... ok (16ms)
test color_as_hexagon(color) > should correctly emit hexagon schemes from samples ... ok (61ms)

test result: ok. 2 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (123ms)

#+end_src

**** color_as_tints

**** color_as_tones

**** color_as_shades

**** color_as_material

**** color_as_blend

**** color_as_interpolation

**** color_as_token

**** color_as_element

**** palette_shift

**** palette_sort

**** palette_filter

**** palette_contrast

**** palette_daltonize

*** Modular Scale
:PROPERTIES:
:header-args:js: :tangle "./v2/ms.js" :comments both
:END:

**** ms_create

**** ms_modify

**** ms_split

**** ms_format

**** ms_as_tokens

**** ms_as_element

*** Design Tokens
:PROPERTIES:
:header-args:js: :tangle "./v2/tokens.js" :comments both
:END:

**** tokens_as_css

**** tokens_as_scss

**** tokens_as_less

**** tokens_as_styl

**** tokens_as_json

**** tokens_as_yaml

**** tokens_as_gpl

**** tokens_as_sketchpalette

**** tokens_as_tailwind

**** tokens_as_styledict

**** tokens_as_element

** Internals

*** Functional
:PROPERTIES:
:header-args:js: :tangle "./v2/fn.js" :comments both
:END:

**** Composition Internals

#+BEGIN_SRC js :tangle "./v2/fn.js"
function compose(...fns) {
  return (x) => fns.reduce((g, f) => f(g), x);
}
#+END_SRC

*** Color
:PROPERTIES:
:header-args:js: :tangle "./v2/color.js" :comments both
:END:

QuarkSuite accepts and processes most valid CSS color formats defined in [[https://www.w3.org/TR/css-color-4/][CSS Color Module Level 4]]. There are no color objects
to pass around, you just use the colors themselves and get colors back.

**** Conversion

Under the hood, a sequence of tokenization, validation, extraction, parsing, conversion, and serialization (mostly)
guarantees correct color input /and/ output. So wield those colors with confidence.

